/*
 * param.h
 *
 *  Created on: Feb 15, 2026
 *      Author: Max
 *
 * Поддержка:
 *   - PARAM_LIST: настраиваемые параметры
 *   - STAT_LIST:  динамические статусы
 *
 * Формат записи:
 *   X(ID, значение_по_умолчанию, "Отображаемое имя")
 *
 * Пример:
 *   X(TEMP_SENSOR, -5, "Temperature Sensor")
 *
 * Доступ в коде:
 *   PARAM(TEMP_SENSOR) = -10;
 *   STATUS(UPTIME_SEC) = get_uptime();
 */

#ifndef PARAMS_H
#define PARAMS_H

#include <stdint.h>
#include "template_config.h"


// ============================================================================
// ИНДЕКСЫ ПАРАМЕТРОВ (только ID)
// ============================================================================
#define X(id, val, str) id##_IDX,
enum {
    PARAM_LIST
    PARAM_N
};
#undef X

// ============================================================================
// ИНДЕКСЫ СТАТУСОВ
// ============================================================================
#define X(id, val, str) id##_IDX,
enum {
    STAT_LIST
    STAT_N
};
#undef X

// ============================================================================
// RAM-СТРУКТУРА (для SWD)
// begin — сигнатура, чтобы найти в памяти
// ============================================================================
extern struct param_mem {
    volatile uint32_t begin;                // сигнатура RAM-блока
    volatile int32_t param[PARAM_N];
    volatile int32_t status[STAT_N];
} param_mem;

// ============================================================================
// УДОБНЫЙ ДОСТУП ЧЕРЕЗ ID
// PARAM(SAVE_TIMER) и STATUS(UPTIME_SEC)
// ============================================================================
#define PARAM(id)  param_mem.param[id##_IDX]
#define STATUS(id) param_mem.status[id##_IDX]

// ============================================================================
// ИНИЦИАЛИЗАЦИЯ
// ============================================================================
void params_init(void);
void params_cycle(void);
#endif // PARAMS_H
